{"config": {"layers": [{"config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 1, 2], "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "trainable": true, "units": 16, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "trainable": true, "units": 16, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_3", "trainable": true, "units": 16, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_4", "trainable": true, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}