{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 1, 2], "trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}