{"class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_1", "batch_input_shape": [null, 1, 2], "trainable": true}}, {"class_name": "Dense", "config": {"units": 16, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 16, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dense", "config": {"units": 16, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Dense", "config": {"units": 1, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_4", "trainable": true}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}