{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "batch_input_shape": [null, 1, 2], "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "linear", "kernel_regularizer": null, "units": 16}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_2", "activation": "linear", "kernel_regularizer": null, "units": 16}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_3", "activation": "linear", "kernel_regularizer": null, "units": 16}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_4", "activation": "linear", "kernel_regularizer": null, "units": 1}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "linear", "trainable": true}}], "name": "sequential_1"}, "keras_version": "2.2.4"}