{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 1, 2], "trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 16, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"units": 16, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"units": 16, "name": "dense_3", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"units": 1, "name": "dense_4", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_4"}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}