{"config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 1, 2], "dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 16, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "units": 1, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_2"}, "class_name": "Activation"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}