{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "batch_input_shape": [null, 1, 2], "name": "flatten_1", "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_3", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_4", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 1}}], "name": "sequential_1"}}