{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 1, 2], "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}