{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true, "batch_input_shape": [null, 1, 3], "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "units": 16, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "units": 16, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "units": 16, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "units": 1, "use_bias": true, "bias_regularizer": null, "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "linear"}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}